<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Project 1: Standardized Test Analysis

--- 
# Part 1

Part 1 requires knowledge of basic Python.

---

## Problem Statement

The Steppingstone Foundation recently established their program in the state of California in the 10 largest public school districts. Over the past few years they've noticed a problem with some students ability to gain acceptance into private schools. They want to know within each district, which public high schools would be potential candidates to explore as recommendations for students and their families, if they wanted to send students to the top 50 ranked US colleges or universities.

### Contents:
- [Background](#Background)
- [Data Import & Cleaning](#Data-Import-and-Cleaning)

## Background

The SAT and ACT are standardized tests that many colleges and universities in the United States require for their admissions process. This score is used along with other materials such as grade point average (GPA) and essay responses to determine whether or not a potential student will be accepted to the university.

The SAT has two sections of the test: Evidence-Based Reading and Writing and Math ([*source*](https://www.princetonreview.com/college/sat-sections)). The ACT has 4 sections: English, Mathematics, Reading, and Science, with an additional optional writing section ([*source*](https://www.act.org/content/act/en/products-and-services/the-act/scores/understanding-your-scores.html)). They have different score ranges, which you can read more about on their websites or additional outside sources (a quick Google search will help you understand the scores for each test):
* [SAT](https://collegereadiness.collegeboard.org/sat)
* [ACT](https://www.act.org/content/act/en.html)

Standardized tests have long been a controversial topic for students, administrators, and legislators. Since the 1940's, an increasing number of colleges have been using scores from sudents' performances on tests like the SAT and the ACT as a measure for college readiness and aptitude ([*source*](https://www.minotdailynews.com/news/local-news/2017/04/a-brief-history-of-the-sat-and-act/)). Supporters of these tests argue that these scores can be used as an objective measure to determine college admittance. Opponents of these tests claim that these tests are not accurate measures of students potential or ability and serve as an inequitable barrier to entry. Lately, more and more schools are opting to drop the SAT/ACT requirement for their Fall 2021 applications ([*read more about this here*](https://www.cnn.com/2020/04/14/us/coronavirus-colleges-sat-act-test-trnd/index.html)).

The Steppingstone Foundation is a nonprofit Organization headquartered in Boston, Massachusetts. 

*"Steppingstone envisions a more just and equitable world where all students can actualize the life-transforming benefits of a college degree. Steppingstone prepares students from historically marginalized communities to access, navigate, and graduate from college. In Boston, we provide academic, social-emotional, and college readiness programming from as early as fifth grade and continuing through college graduation. Nationally, we connect the people, practices, and innovations essential for eliminating barriers to college and career success."* ([source](https://www.tsf.org/about-us/mission/))

### Data for Analysis

* [`sat_2019_ca.csv`](./data/sat_2019_ca.csv): 2019 SAT Scores in California by School
* [`sat_act_by_college.csv`](./data/sat_act_by_college.csv): Ranges of Accepted ACT & SAT Student Scores by Colleges

### Outside Research

Top 50 ranked US Colleges / Universities: ([*source*](https://www.usnews.com/best-colleges/rankings/national-universities))

* Princeton University
* Harvard College
* Columbia University 
* Massachusetts Institute of Technology 
* Yale University 
* Stanford University
* University of Chicago 
* University of Pennsylvania
* California Institute of Technology
* Johns Hopkins University 
* Northwestern University 
* Duke University 
* Dartmouth College
* Brown University 
* Vanderbilt University
* Rice University 
* Washington University in St. Louis
* Cornell University 
* University of Notre Dame
* University of California—Los Angeles 
* Emory University
* University of California—Berkeley 
* Georgetown University',
* University of Michigan—Ann Arbor 
* University of Southern California
* University of Virginia 
* University of North Carolina—Chapel Hill 
* Wake Forest University'
* New York University
* Tufts University
* University of California—Santa Barbara
* University of Florida
* University of Rochester
* Boston College
* Georgia Institute of Technology
* University of California—Irvine
* University of California—San Diego
* University of California—Davis
* College of William and Mary
* Tulane University
* Boston University
* Brandeis University
* Case Western Reserve University
* University of Texas—Austin
* University of Wisconsin—Madison
* University of Georgia
* University of Illinois—Urbana-Champaign
* Lehigh University
* Northeastern University
* Pepperdine University
* University of Miami


SAT Benchmarks for 11th grade: ([*source*](https://collegereadiness.collegeboard.org/about/scores/benchmarks))
* Evidence-Based Reading & Writing: 460
    * *"Students with an SAT Evidence-Based Reading and Writing (ERW) section score that meets or exceeds the benchmark have a 75 percent chance of earning at least a C in first-semester, credit-bearing college courses in history, literature, social sciences, or writing classes."*
* Math: 510
    * *"Students with an SAT Math section score that meets or exceeds the benchmark have a 75 percent chance of earning at least a C in first-semester, credit-bearing college courses in algebra, statistics, pre-calculus, or calculus."*

### Coding Challenges

1. Manually calculate mean:

    Write a function that takes in values and returns the mean of the values. Create a list of numbers that you test on your function to check to make sure your function works!
    
    *Note*: Do not use any mean methods built-in to any Python libraries to do this! This should be done without importing any additional libraries.

In [45]:
'''
    Calculate the mean of values in a list
'''

def calc_mean(values):
    return sum(values) / len(values)

test_values = [1, 2, 3, 4, 5]

calc_mean(test_values)

3.0

2. Manually calculate standard deviation:

    The formula for standard deviation is below:

    $$\sigma = \sqrt{\frac{1}{n}\sum_{i=1}^n(x_i - \mu)^2}$$

    Where $x_i$ represents each value in the dataset, $\mu$ represents the mean of all values in the dataset and $n$ represents the number of values in the dataset.

    Write a function that takes in values and returns the standard deviation of the values using the formula above. Hint: use the function you wrote above to calculate the mean! Use the list of numbers you created above to test on your function.
    
    *Note*: Do not use any standard deviation methods built-in to any Python libraries to do this! This should be done without importing any additional libraries.

In [46]:
# Code:
'''
    Calculate the standard deviation of values in a list
'''
def calc_std_deviation(values):
    summed_values = 0
    m = calc_mean(values)
    n = len(values)
    for value in values:
        summed_values += (value - m)**2
    return (summed_values / n)**0.5

test_values = [1, 2, 3, 4, 5]
calc_std_deviation(test_values)

1.4142135623730951

3. Data cleaning function:
    
    Write a function that takes in a string that is a number and a percent symbol (ex. '50%', '30.5%', etc.) and converts this to a float that is the decimal approximation of the percent. For example, inputting '50%' in your function should return 0.5, '30.5%' should return 0.305, etc. Make sure to test your function to make sure it works!

You will use these functions later on in the project!

In [47]:
# Code:
'''
    Convert percentage strings to float percentages.
'''
def to_decimal_percent(percent):
    split = percent.split('%')
    percentage = float(split[0])
    return percentage / 100

to_decimal_percent('30.5%')

0.305

--- 
# Part 2

Part 2 requires knowledge of Pandas, EDA, data cleaning, and data visualization.

---

*All libraries used should be added here*

In [48]:
# Imports:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## Data Import and Cleaning

### Data Import

In [49]:
# Data used for analysis
sat_ca = pd.read_csv('../data/sat_2019_ca.csv')
sat_by_college = pd.read_csv('../data/sat_act_by_college.csv')

#### 2019 California SAT Data Cleaning

In [50]:
# First 5 rows of California SAT data
sat_ca.head()

,CDS,CCode,CDCode,SCode,RType,SName,DName,CName,Enroll12,NumTSTTakr12,...,NumERWBenchmark11,PctERWBenchmark11,NumMathBenchmark11,PctMathBenchmark11,TotNumBothBenchmark12,PctBothBenchmark12,TotNumBothBenchmark11,PctBothBenchmark11,Year,Unnamed: 25
0,6.615981e+12,6.0,661598.0,630046.0,S,Colusa Alternative Home,Colusa Unified,Colusa,18.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018-19,NaN
1,6.616061e+12,6.0,661606.0,634758.0,S,Maxwell Sr High,Maxwell Unified,Colusa,29.0,10.0,...,*,*,*,*,*,*,*,*,2018-19,NaN
2,1.964733e+13,19.0,1964733.0,1930924.0,S,Belmont Senior High,Los Angeles Unified,Los Angeles,206.0,102.0,...,42,24.14,12,6.90,14,13.73,11,6.32,2018-19,NaN
3,1.964733e+13,19.0,1964733.0,1931476.0,S,Canoga Park Senior High,Los Angeles Unified,Los Angeles,227.0,113.0,...,97,35.27,37,13.45,18,15.93,35,12.73,2018-19,NaN
4,1.964733e+13,19.0,1964733.0,1931856.0,S,Whitman Continuation,Los Angeles Unified,Los Angeles,18.0,14.0,...,*,*,*,*,*,*,*,*,2018-19,NaN

*First 5 rows of 2019 California SAT Scores data*

In [51]:
# Check Data Types and Shape of California SAT data
sat_ca.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2580 entries, 0 to 2579
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   CDS                    2579 non-null   float64
 1   CCode                  2579 non-null   float64
 2   CDCode                 2579 non-null   float64
 3   SCode                  2579 non-null   float64
 4   RType                  2579 non-null   object
 5   SName                  1982 non-null   object
 6   DName                  2521 non-null   object
 7   CName                  2579 non-null   object
 8   Enroll12               2579 non-null   float64
 9   NumTSTTakr12           2579 non-null   float64
 10  NumERWBenchmark12      2304 non-null   object
 11  PctERWBenchmark12      2304 non-null   object
 12  NumMathBenchmark12     2304 non-null   object
 13  PctMathBenchmark12     2304 non-null   object
 14  Enroll11               2579 non-null   float64
 15  NumTSTTakr11           2579 non-null   float64
 16  NumERWBenchmark11      2269 non-null   object
 17  PctERWBenchmark11      2269 non-null   object
 18  NumMathBenchmark11     2269 non-null   object
 19  PctMathBenchmark11     2269 non-null   object
 20  TotNumBothBenchmark12  2304 non-null   object
 21  PctBothBenchmark12     2304 non-null   object
 22  TotNumBothBenchmark11  2269 non-null   object
 23  PctBothBenchmark11     2269 non-null   object
 24  Year                   2579 non-null   object
 25  Unnamed: 25            0 non-null      float64
dtypes: float64(9), object(17)
memory usage: 524.2+ KB

In [52]:
# Drop unwanted columns
columns_to_drop = ['Unnamed: 25', 'Year', 'CDS', 'CCode', 'CDCode', 'SCode', 'RType', 'CName',
                  'Enroll12', 'NumTSTTakr12', 'NumERWBenchmark12', 'PctERWBenchmark12', 'NumMathBenchmark12',
                   'PctMathBenchmark12', 'TotNumBothBenchmark12', 'PctBothBenchmark12']
sat_ca.drop(columns = columns_to_drop, inplace = True)

In [53]:
# Check that columns were dropped
sat_ca.head()

,SName,DName,Enroll11,NumTSTTakr11,NumERWBenchmark11,PctERWBenchmark11,NumMathBenchmark11,PctMathBenchmark11,TotNumBothBenchmark11,PctBothBenchmark11
0,Colusa Alternative Home,Colusa Unified,18.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Maxwell Sr High,Maxwell Unified,26.0,6.0,*,*,*,*,*,*
2,Belmont Senior High,Los Angeles Unified,219.0,174.0,42,24.14,12,6.90,11,6.32
3,Canoga Park Senior High,Los Angeles Unified,333.0,275.0,97,35.27,37,13.45,35,12.73
4,Whitman Continuation,Los Angeles Unified,17.0,5.0,*,*,*,*,*,*

In [54]:
# Check current shape of California Data
sat_ca.shape

(2580, 10)

In [55]:
sat_ca.head()

,SName,DName,Enroll11,NumTSTTakr11,NumERWBenchmark11,PctERWBenchmark11,NumMathBenchmark11,PctMathBenchmark11,TotNumBothBenchmark11,PctBothBenchmark11
0,Colusa Alternative Home,Colusa Unified,18.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Maxwell Sr High,Maxwell Unified,26.0,6.0,*,*,*,*,*,*
2,Belmont Senior High,Los Angeles Unified,219.0,174.0,42,24.14,12,6.90,11,6.32
3,Canoga Park Senior High,Los Angeles Unified,333.0,275.0,97,35.27,37,13.45,35,12.73
4,Whitman Continuation,Los Angeles Unified,17.0,5.0,*,*,*,*,*,*

In [56]:
# Rename all columns
new_columns = [
    'school_name',
    'district_name',
    'enrollment11',
    'num_testtakers11',
    'num_erwbenchmark11',
    'pct_erwbenchmark11',
    'num_mathbenchmark11',
    'pct_mathbenchmark11',
    'total_num_bothbenchmark11',
    'pct_bothbenchmark11'
]
sat_ca.columns = new_columns
sat_ca.head()

,school_name,district_name,enrollment11,num_testtakers11,num_erwbenchmark11,pct_erwbenchmark11,num_mathbenchmark11,pct_mathbenchmark11,total_num_bothbenchmark11,pct_bothbenchmark11
0,Colusa Alternative Home,Colusa Unified,18.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Maxwell Sr High,Maxwell Unified,26.0,6.0,*,*,*,*,*,*
2,Belmont Senior High,Los Angeles Unified,219.0,174.0,42,24.14,12,6.90,11,6.32
3,Canoga Park Senior High,Los Angeles Unified,333.0,275.0,97,35.27,37,13.45,35,12.73
4,Whitman Continuation,Los Angeles Unified,17.0,5.0,*,*,*,*,*,*

In [57]:
# Check all data types of table
sat_ca.dtypes

school_name                   object
district_name                 object
enrollment11                 float64
num_testtakers11             float64
num_erwbenchmark11            object
pct_erwbenchmark11            object
num_mathbenchmark11           object
pct_mathbenchmark11           object
total_num_bothbenchmark11     object
pct_bothbenchmark11           object
dtype: object

In [58]:
# Check to see why numerical fields are being treated as objects
column_names = ['num_erwbenchmark11', 'pct_erwbenchmark11', 'num_mathbenchmark11',
               'pct_mathbenchmark11', 'total_num_bothbenchmark11', 'pct_bothbenchmark11']
def check_objects(columns):
    for column in columns:
        print(sat_ca[column].sort_values().head())

check_objects(column_names)

1       *
1363    *
1364    *
455     *
1369    *
Name: num_erwbenchmark11, dtype: object
1       *
1319    *
1327    *
445     *
1330    *
Name: pct_erwbenchmark11, dtype: object
1       *
595     *
1756    *
1754    *
604     *
Name: num_mathbenchmark11, dtype: object
1       *
498     *
1042    *
1040    *
1817    *
Name: pct_mathbenchmark11, dtype: object
1       *
1713    *
1711    *
581     *
586     *
Name: total_num_bothbenchmark11, dtype: object
1       *
1850    *
933     *
934     *
937     *
Name: pct_bothbenchmark11, dtype: object

In [59]:
# Helper Function to convert values to floats
# Function taken from intro to pandas GA lecture
def to_num(x):
    try:
        out = float(x)
    except:
        out = np.nan
    return out

In [60]:
# Convert all columns with incorrect data types to floats
def convert_to_num(columns):
    for column in columns:
        sat_ca[column] = sat_ca[column].apply(to_num)
        
convert_to_num(column_names)

In [61]:
# Check conversions worked
def check_conversions(columns):
    for column in columns:
        print(sat_ca[column].sort_values().head())
    
check_conversions(column_names)

1727    0.0
1958    0.0
309     0.0
1395    1.0
161     1.0
Name: num_erwbenchmark11, dtype: float64
1727    0.00
1958    0.00
309     0.00
467     1.75
1078    2.27
Name: pct_erwbenchmark11, dtype: float64
1160    0.0
60      0.0
287     0.0
1395    0.0
1641    0.0
Name: num_mathbenchmark11, dtype: float64
598     0.0
137     0.0
84      0.0
1200    0.0
1641    0.0
Name: pct_mathbenchmark11, dtype: float64
467     0.0
1160    0.0
940     0.0
1808    0.0
1395    0.0
Name: total_num_bothbenchmark11, dtype: float64
1080    0.0
598     0.0
60      0.0
705     0.0
727     0.0
Name: pct_bothbenchmark11, dtype: float64

In [62]:
# Check data types
sat_ca.dtypes

school_name                   object
district_name                 object
enrollment11                 float64
num_testtakers11             float64
num_erwbenchmark11           float64
pct_erwbenchmark11           float64
num_mathbenchmark11          float64
pct_mathbenchmark11          float64
total_num_bothbenchmark11    float64
pct_bothbenchmark11          float64
dtype: object

In [63]:
# Check for missing data in California Data
sat_ca.isna().sum()

school_name                  598
district_name                 59
enrollment11                   1
num_testtakers11               1
num_erwbenchmark11           844
pct_erwbenchmark11           844
num_mathbenchmark11          844
pct_mathbenchmark11          844
total_num_bothbenchmark11    844
pct_bothbenchmark11          844
dtype: int64

In [64]:
# Check for the percentage of missing data in California Data
sat_ca.isna().mean() * 100

school_name                  23.178295
district_name                 2.286822
enrollment11                  0.038760
num_testtakers11              0.038760
num_erwbenchmark11           32.713178
pct_erwbenchmark11           32.713178
num_mathbenchmark11          32.713178
pct_mathbenchmark11          32.713178
total_num_bothbenchmark11    32.713178
pct_bothbenchmark11          32.713178
dtype: float64

In [65]:
# Drop all missing values in California Data
sat_ca.dropna(inplace = True)
sat_ca.shape

(1285, 10)

In [66]:
# Check for anymore missing values
sat_ca.isnull().mean()

school_name                  0.0
district_name                0.0
enrollment11                 0.0
num_testtakers11             0.0
num_erwbenchmark11           0.0
pct_erwbenchmark11           0.0
num_mathbenchmark11          0.0
pct_mathbenchmark11          0.0
total_num_bothbenchmark11    0.0
pct_bothbenchmark11          0.0
dtype: float64

In [67]:
# Extract 10 largest school districts
# source: https://www.cde.ca.gov/ds/ad/ceflargesmalldist.asp
districts = [
    'Los Angeles Unified',
    'San Diego Unified',
    'Fresno Unified',
    'Long Beach Unified',
    'Elk Grove Unified',
    'San Francisco Unified',
    'San Bernardino City Unified',
    'Capistrano Unified',
    'Corona-Norco Unified',
    'San Juan Unified'
]
sat_ca = sat_ca[sat_ca['district_name'].isin(districts)]

In [68]:
# Check all districts were correctly extracted
sat_ca['district_name'].unique()

array(['Los Angeles Unified', 'Corona-Norco Unified', 'San Diego Unified',
       'San Francisco Unified', 'San Bernardino City Unified',
       'San Juan Unified', 'Elk Grove Unified', 'Fresno Unified',
       'Long Beach Unified', 'Capistrano Unified'], dtype=object)

In [69]:
sat_ca.head()

,school_name,district_name,enrollment11,num_testtakers11,num_erwbenchmark11,pct_erwbenchmark11,num_mathbenchmark11,pct_mathbenchmark11,total_num_bothbenchmark11,pct_bothbenchmark11
2,Belmont Senior High,Los Angeles Unified,219.0,174.0,42.0,24.14,12.0,6.90,11.0,6.32
3,Canoga Park Senior High,Los Angeles Unified,333.0,275.0,97.0,35.27,37.0,13.45,35.0,12.73
5,Foshay Learning Center,Los Angeles Unified,187.0,183.0,91.0,49.73,47.0,25.68,44.0,24.04
9,New Open World Academy K-12,Los Angeles Unified,79.0,79.0,22.0,27.85,10.0,12.66,6.0,7.59
10,Corona High,Corona-Norco Unified,572.0,168.0,128.0,76.19,84.0,50.00,78.0,46.43

In [70]:
sat_ca.shape

(318, 10)

In [71]:
# save cleaned SAT California Data to csv
sat_ca.to_csv('../data/sat_2019_ca_clean.csv', index = False)

#### SAT By College Data Cleaning

In [72]:
# Display first 5 rows of College SAT Data
sat_by_college.head()

,School,Test Optional?,Applies to Class Year(s),Policy Details,Number of Applicants,Accept Rate,SAT Total 25th-75th Percentile,ACT Total 25th-75th Percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,4.3%,1440-1570,32-35
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,4.7%,1460-1580,33-35
2,Princeton University,Yes,2021,Princeton has adopted a one-year test optional...,35370,5.5%,1440-1570,32-35
3,Columbia University,Yes,2021,Columbia has adopted a one-year test optional ...,40203,5.5%,1450-1560,33-35
4,Yale University,Yes,2021,Yale has adopted a one-year test optional poli...,36844,6.1%,1460-1570,33-35

In [73]:
# Check data types and null entries
sat_by_college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 416 entries, 0 to 415
Data columns (total 8 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   School                          416 non-null    object
 1   Test Optional?                  416 non-null    object
 2   Applies to Class Year(s)        390 non-null    object
 3   Policy Details                  416 non-null    object
 4   Number of Applicants            416 non-null    int64
 5   Accept Rate                     416 non-null    object
 6   SAT Total 25th-75th Percentile  416 non-null    object
 7   ACT Total 25th-75th Percentile  416 non-null    object
dtypes: int64(1), object(7)
memory usage: 26.1+ KB

In [74]:
# Drop unwanted columns for College SAT data
sat_by_college.drop(columns = ['Test Optional?', 'Applies to Class Year(s)', 'Policy Details', 'Number of Applicants', 'Accept Rate', 'ACT Total 25th-75th Percentile'], inplace = True)

In [75]:
sat_by_college.head()

                 School SAT Total 25th-75th Percentile
0   Stanford University                      1440-1570
1       Harvard College                      1460-1580
2  Princeton University                      1440-1570
3   Columbia University                      1450-1560
4       Yale University                      1460-1570

In [76]:
# Rename Columns
sat_by_college.columns = ['school', 'sat_scores']
sat_by_college.head()

                 school sat_scores
0   Stanford University  1440-1570
1       Harvard College  1460-1580
2  Princeton University  1440-1570
3   Columbia University  1450-1560
4       Yale University  1460-1570

In [77]:
# Check for missing values
sat_by_college.isnull().sum()

school        0
sat_scores    0
dtype: int64

In [78]:
# Filter out ranked Top 50 Colleges and Universitys
top_50 = [
    'Princeton University', 'Harvard College', 'Columbia University', 
    'Massachusetts Institute of Technology', 'Yale University', 'Stanford University', 
    'University of Chicago', 'University of Pennsylvania', 'California Institute of Technology', 
    'Johns Hopkins University', 'Northwestern University', 'Duke University', 'Dartmouth College', 
    'Brown University', 'Vanderbilt University', 'Rice University', 'Washington University in St. Louis', 
    'Cornell University', 'University of Notre Dame',
    'University of California—\u200bLos Angeles', 'Emory University', 
    'University of California—\u200bBerkeley', 'Georgetown University',
    'University of Michigan—\u200bAnn Arbor', 'University of Southern California',
    'University of Virginia', 'University of North Carolina—\u200bChapel Hill', 'Wake Forest University',
    'New York University', 'Tufts University', 'University of California—\u200bSanta Barbara',
    'University of Florida', 'University of Rochester', 'Boston College', 'Georgia Institute of Technology',
    'University of California—\u200bIrvine', 'University of California—\u200bSan Diego',
    'University of California—\u200bDavis', 'College of William and Mary',
    'Tulane University', 'Boston University', 'Brandeis University', 'Case Western Reserve University',
    'University of Texas—\u200bAustin', 'University of Wisconsin—\u200bMadison',
    'University of Georgia', 'University of Illinois—\u200bUrbana-\u200bChampaign',
    'Lehigh University', 'Northeastern University', 'Pepperdine University', 'University of Miami'
]

sat_by_college = sat_by_college[sat_by_college['school'].isin(top_50)]

In [79]:
# Check all filtered colleges and universities
sat_by_college.shape

(51, 2)

In [80]:
sat_by_college.isnull().sum()

school        0
sat_scores    0
dtype: int64

In [81]:
sat_by_college['sat_scores'].unique()

array(['1440-1570', '1460-1580', '1450-1560', '1460-1570',
       '\u200b\u200b 1530-1560', '\u200b\u200b 1500-1570',
       '\u200b\u200b 1440-1570', '\u200b\u200b 1490-1570', '1440-1560',
       '1450-1570', '1440-1550', '1460-1560', '1470-1560', '1400-1560',
       '1290-1510', '1360-1520', '1350-1530', '1370-1530', '1300-1530',
       '1390-1540', '1470-1570', '1400-1550', '1370-1510', '1350-1520',
       '1300-1510', '1330-1500', '1300-1490', '1340-1530', '1340-1500',
       '1180-1440', '1280-1420', '1370-1490', '1300-1500', '1260-1460',
       '1320-1490', '1250-1470', '1280-1500', '1240-1470', '1280-1450',
       '1220-1420', '1320-1510', '1150-1410', '1240-1410', '1330-1450',
       '1220-1480', '1280-1440'], dtype=object)

In [82]:
# Get rid of special characters
sat_by_college['sat_scores'] = sat_by_college['sat_scores'].str.replace('\u200b\u200b ', '')
sat_by_college['sat_scores'].unique()

array(['1440-1570', '1460-1580', '1450-1560', '1460-1570', '1530-1560',
       '1500-1570', '1490-1570', '1440-1560', '1450-1570', '1440-1550',
       '1460-1560', '1470-1560', '1400-1560', '1290-1510', '1360-1520',
       '1350-1530', '1370-1530', '1300-1530', '1390-1540', '1470-1570',
       '1400-1550', '1370-1510', '1350-1520', '1300-1510', '1330-1500',
       '1300-1490', '1340-1530', '1340-1500', '1180-1440', '1280-1420',
       '1370-1490', '1300-1500', '1260-1460', '1320-1490', '1250-1470',
       '1280-1500', '1240-1470', '1280-1450', '1220-1420', '1320-1510',
       '1150-1410', '1240-1410', '1330-1450', '1220-1480', '1280-1440'],
      dtype=object)

In [83]:
# Split SAT range into separate columns
sat_by_college[['low_score', 'high_score']] = sat_by_college['sat_scores'].str.split(pat = '-', expand = True)

# Check Data types and for correct columns
print(sat_by_college.dtypes)
sat_by_college.head()

school        object
sat_scores    object
low_score     object
high_score    object
dtype: object

                 school sat_scores low_score high_score
0   Stanford University  1440-1570      1440       1570
1       Harvard College  1460-1580      1460       1580
2  Princeton University  1440-1570      1440       1570
3   Columbia University  1450-1560      1450       1560
4       Yale University  1460-1570      1460       1570

In [84]:
sat_by_college['low_score'].unique()

array(['1440', '1460', '1450', '1530', '1500', '1490', '1470', '1400',
       '1290', '1360', '1350', '1370', '1300', '1390', '1330', '1340',
       '1180', '1280', '1260', '1320', '1250', '1240', '1220', '1150'],
      dtype=object)

In [85]:
sat_by_college['high_score'].unique()

array(['1570', '1580', '1560', '1550', '1510', '1520', '1530', '1540',
       '1500', '1490', '1440', '1420', '1460', '1470', '1450', '1410',
       '1480'], dtype=object)

In [86]:
# Drop sat_scores column
sat_by_college.drop(columns = ['sat_scores'], inplace = True)
sat_by_college.head()

                 school low_score high_score
0   Stanford University      1440       1570
1       Harvard College      1460       1580
2  Princeton University      1440       1570
3   Columbia University      1450       1560
4       Yale University      1460       1570

In [87]:
# Convert string scores to numerical scores using previous to_num() helper function
sat_by_college['low_score'] = sat_by_college['low_score'].apply(to_num)
sat_by_college['high_score'] = sat_by_college['high_score'].apply(to_num)

# Check data types and first 5 rows of data
print(sat_by_college.dtypes)
sat_by_college.head()

school         object
low_score     float64
high_score    float64
dtype: object

                 school  low_score  high_score
0   Stanford University     1440.0      1570.0
1       Harvard College     1460.0      1580.0
2  Princeton University     1440.0      1570.0
3   Columbia University     1450.0      1560.0
4       Yale University     1460.0      1570.0

In [88]:
# save cleaned SAT College Data to csv
sat_by_college.to_csv('../data/sat_by_college_clean.csv', index = False)

### Data Dictionary

#### SAT By College Data Dictionary
|Feature|Type|Dataset|Description|
|---|---|---|---|
|**school**|*object*|SAT by College|Name of each indiviual school|
|**low_score**|*float*|SAT by College|Lowest possible score to be considered for admittance|
|**high_score**|*float*|SAT by College|High score to be considered for admittance|

#### 2019 California High School SAT Data Dictionary

|Feature|Type|Dataset|Description|
|---|---|---|---|
|**school_name**|*object*|2019 California High School SAT Scores|Name of high school|
|**district_name**|*object*|2019 California High School SAT Scores|Name of district|
|**county_name**|*object*|2019 California High School SAT Scores|Name of county|
|**enrollment11**|*float*|2019 California High School SAT Scores|Enrollment of Grade 11|
|**num_testtakers11**|*float*|2019 California High School SAT Scores|Number of Test Takers Grade 11|
|**num_erwbenchmark11**|*float*|2019 California High School SAT Scores|The number meeting the Evidence-Based Reading & Writing (ERW) benchmark established by the College Board for Grade 11|
|**pct_erwbenchmark11**|*float*|2019 California High School SAT Scores|The percent of students who met or exceeded the benchmark for Evidence-Based Reading & Writing (ERW) test for Grade 11|
|**num_mathbenchmark11**|*float*|2019 California High School SAT Scores|The number of students who met or exceeded the benchmark for the SAT Math test for Grade 11|
|**pct_mathbenchmark11**|*float*|2019 California High School SAT Scores|The percent of students who met or exceeded the benchmark for SAT Math test for Grade 11|
|**total_num_bothbenchmark11**|*float*|2019 California High School SAT Scores|The total number of students who met the benchmark of both Evidence-Based Reading & Writing (ERW) and Math Grade 11|
|**pct_bothbenchmark11**|*float*|2019 California High School SAT Scores|The percent of students who met the benchmark of both Evidence-Based Reading & Writing (ERW) and Math Grade 11|

([*source for California data dictionary descriptions*](https://www.cde.ca.gov/ds/sp/ai/reclayoutsat19.asp))